In [1]:
import pandas as pd

In [2]:
titanic = pd.read_csv("train.csv")

In [3]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# Задание 1

In [8]:
print(f"Мужчин: {titanic['Sex'].value_counts()['male']}, Женщин: {titanic['Sex'].value_counts()['female']}")

Мужчин: 577, Женщин: 314

# Задание 2

In [10]:
print(f"Cherbourg: {titanic['Embarked'].value_counts()['C']}, Queenstown: {titanic['Embarked'].value_counts()['Q']}, Southampton: {titanic['Embarked'].value_counts()['S']}")

Cherbourg: 168, Queenstown: 77, Southampton: 644

# Задание 3

In [18]:
all_people = titanic.iloc[-1]['PassengerId']

In [25]:
print(f'{round(((titanic['Survived'].value_counts()[0]) / all_people * 100), 2)} % погибло, Всего погибло: {(titanic['Survived'].value_counts()[0])}')

61.62 % погибло, Всего погибло: 549

# Задание 4

In [41]:
print(f'{round((titanic["Pclass"] == 1).sum() / all_people * 100, 2)} % в первом классе')

24.24 % в первом классе

In [42]:
print(f'{round((titanic["Pclass"] == 2).sum() / all_people * 100, 2)} % во втором классе')

20.65 % во втором классе

In [43]:
print(f'{round((titanic["Pclass"] == 3).sum() / all_people * 100, 2)} % в третьем классе')

55.11 % в третьем классе

# Задание 5

In [44]:
spouses_children = titanic[['SibSp', 'Parch']]

In [46]:
spouses_children.corr(method='pearson')

          SibSp     Parch
SibSp  1.000000  0.414838
Parch  0.414838  1.000000

# Задание 6

In [68]:
age_survived = titanic[['Age', 'Survived']]
age_survived.corr(method='pearson')

               Age  Survived
Age       1.000000 -0.077221
Survived -0.077221  1.000000

Корреляция между возрастом и параметром Survived практически **нулевая**

In [67]:
titanic['SexInt'] = titanic['Sex'].map({"male": 0, "female": 1})

sex_survived = titanic[['SexInt', 'Survived']]
sex_survived.corr(method='pearson')

            SexInt  Survived
SexInt    1.000000  0.543351
Survived  0.543351  1.000000

Корреляция между полом и параметром Survived **положительная и равна примерно 0.54 по методу Пирсона**

In [54]:
pclass_survived = titanic[['Pclass', 'Survived']]
pclass_survived.corr(method='pearson')

            Pclass  Survived
Pclass    1.000000 -0.338481
Survived -0.338481  1.000000

Корреляция между классом кабины и параметром Survived **отрицательна и равна примерно -0.33 по методу Пирсона**.
Чем престижнее класс, тем более высок параметр Survived

# Задание 7

In [80]:
print(f'Средний возраст пассажиров: {round(titanic['Age'].mean(),1)} лет') 
print(f'Медиана возраста: {titanic['Age'].median()} лет')
print(f'Максимальный возраст: {titanic['Age'].max()} лет')
print(f'Минимальный возраст: {titanic['Age'].min()}, Приблизительно 5 месяцев')

Средний возраст пассажиров: 29.7 лет
Медиана возраста: 28.0 лет
Максимальный возраст: 80.0 лет
Минимальный возраст: 0.42, Приблизительно 5 месяцев

# Задание 8

In [84]:
print(f'Средняя стоимость билета: {round(titanic['Fare'].mean(),3)}') 
print(f'Медиана стоимости билета: {titanic['Fare'].median()} долларов')
print(f'Максимальная цена билета: {titanic['Fare'].max()} долларов')
print(f'Минимальная цена билета: {titanic['Fare'].min()} долларов')

Средняя стоимость билета: 32.204
Медиана стоимости билета: 14.4542 долларов
Максимальная цена билета: 512.3292 долларов
Минимальная цена билета: 0.0 долларов

# Задание 9

In [125]:
male_names = titanic.loc[titanic['Sex']=='male', 'Name']


def extract_first_name(full_name):
    # разделяем по запятой, берем вторую часть, затем по точке, берем вторую часть
    return full_name.split(', ')[1].split('. ')[1].split(' ')[0]

male_first_names = male_names.apply(extract_first_name)

most_common_male_name = male_first_names.mode()[0]
print(f'Самое популярное мужское имя: {most_common_male_name}')

Самое популярное мужское имя: William

# Задание 10

In [132]:
male_names_above_15 = titanic.query("Sex == 'male' and Age > 15")['Name']
female_names_above_15 = titanic.query("Sex == 'female' and Age > 15")['Name']

def extract_first_name(full_name):
    try:
        name_part = full_name.split(', ')[1].split('. ')[1]
        if '(' in name_part and ')' in name_part:
            name_in_brackets = name_part.split('(')[1].split(')')[0]
            return name_in_brackets.split(' ')[0]
        return name_part.split(' ')[0]
    except IndexError:
        return None

male_first_names_above_15 = male_names_above_15.apply(extract_first_name).dropna()
female_first_names_above_15 = female_names_above_15.apply(extract_first_name).dropna()

most_common_male = male_first_names_above_15.mode()[0]
most_common_female = female_first_names_above_15.mode()[0]

print(f'Самое популярное мужское имя (старше 15): {most_common_male}')
print(f'Самое популярное женское имя (старше 15): {most_common_female}')

Самое популярное мужское имя (старше 15): William
Самое популярное женское имя (старше 15): Anna